src/cf/Enums/ВидыАгентскихДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыАгентскихДоговоров</Name>
			<Comment>Виды договоров, согласно которым организация выступает в качестве налогового агента</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аренда</Name>
					<Comment>Договор аренды муниципального имущества</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияИмущества</Name>
					<Comment>Договор покупки государственного или муниципального имущества</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нерезидент</Name>
					<Comment>Договор с контрагентом (иностранной компанией) не являющимся плательщиком НДС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НерезидентЭлектронныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияТоваров</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыАгентскихДоговоров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область СлужебныйПрограммныйИнтерфейс

// Определяет порядок уплаты налога в зависимости от переданного вида агентского договора.
// Анализируется только налоговый агент по приобретению, налоговый агент при реализации комиссионных товаров
// или услуг в данной функции не рассматривается.
// Параметры:
//     ВидАгентскогоДоговора - ПеречислениеСсылка.ВидыАгентскихДоговоров - вид договора налогового агента, 
//                             для которого необходимо определить порядок уплаты.
// Возвращаемое значение:
//     Булево - Истина - если налог уплачивается сразу при начислении,
//              Ложь - если налог уплачивается по 1/3 в течение квартала, следующего за кварталом начисления.
Функция НалогУплачиваетсяПриНачислении(ВидАгентскогоДоговора) Экспорт

	Возврат ВидАгентскогоДоговора = Перечисления.ВидыАгентскихДоговоров.Нерезидент Или ВидАгентскогоДоговора
		= Перечисления.ВидыАгентскихДоговоров.НерезидентЭлектронныеУслуги;

КонецФункции

// Определяет, относится ли переданный вид агентского договора договором с нерезидентом.
// Анализируется только налоговый агент по приобретению, налоговый агент при реализации комиссионных товаров
// или услуг в данной функции не рассматривается.
// Параметры:
//     ВидАгентскогоДоговора - ПеречислениеСсылка.ВидыАгентскихДоговоров - вид договора налогового агента, 
//                             для которого необходимо определить признак.
// Возвращаемое значение:
//     Булево - Истина - договор с нерезидентом,
//              Ложь - договор с резидентом.
Функция ЭтоНерезидент(ВидАгентскогоДоговора) Экспорт

	Возврат НалогУплачиваетсяПриНачислении(ВидАгентскогоДоговора);

КонецФункции

// Возвращает массив видов договоров налогового агента по которым требуется округление налога.
// Параметры:
//     ОкруглятьПоВсемДоговорамНА - Булево - признак того, что нужно округлять НДС по всем договорам налогового агента.
// Возвращаемое значение:
//     ВидыДоговоров - Массив - массив значений виды ПеречислениеСсылка.ВидыАгентскихДоговоров.
Функция МассивВидовДоговоровТребующихОкругленияНалога(ОкруглятьПоВсемДоговорамНА = Ложь) Экспорт

	ВидыДоговоров = Новый Массив;
	ВидыДоговоров.Добавить(Перечисления.ВидыАгентскихДоговоров.Нерезидент);
	ВидыДоговоров.Добавить(Перечисления.ВидыАгентскихДоговоров.НерезидентЭлектронныеУслуги);
	ВидыДоговоров.Добавить(Перечисления.ВидыАгентскихДоговоров.РеализацияИмущества);
	Если ОкруглятьПоВсемДоговорамНА Тогда
		ВидыДоговоров.Добавить(Перечисления.ВидыАгентскихДоговоров.Аренда);
	КонецЕсли;

	Возврат ВидыДоговоров;

КонецФункции

// Возвращает массив видов договоров налогового агента с нерезидентом.
// Возвращаемое значение:
//     ВидыДоговоров - Массив - массив значений виды ПеречислениеСсылка.ВидыАгентскихДоговоров.
Функция МассивВидовДоговоровСНерезидентом() Экспорт

	ВидыДоговоров = Новый Массив;
	ВидыДоговоров.Добавить(Перечисления.ВидыАгентскихДоговоров.Нерезидент);
	ВидыДоговоров.Добавить(Перечисления.ВидыАгентскихДоговоров.НерезидентЭлектронныеУслуги);

	Возврат ВидыДоговоров;

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ДанныеВыбора         = ПолучитьДоступныеЗначения(Параметры.Отбор, Параметры.СтрокаПоиска);

КонецПроцедуры

#КонецОбласти

Функция ПолучитьДоступныеЗначения(Отбор, СтрокаПоиска)

	Исключения = Новый Массив;

	Исключения.Добавить(Перечисления.ВидыАгентскихДоговоров.РеализацияТоваров);

	Если ТипЗнч(Отбор) = Тип("Структура") И Отбор.Свойство("ИностранныйКонтрагент") Тогда 
		
		// Для списков с отбором не показываем для выбора вид агентского договора "Электронные услуги"
		Исключения.Добавить(Перечисления.ВидыАгентскихДоговоров.НерезидентЭлектронныеУслуги);
		Если Не Отбор.ИностранныйКонтрагент Тогда
			Исключения.Добавить(Перечисления.ВидыАгентскихДоговоров.Нерезидент);
		КонецЕсли;

	КонецЕсли;

	ДоступныеЗначения = Новый СписокЗначений;

	Для Каждого ЗначениеПеречисления Из Метаданные.Перечисления.ВидыАгентскихДоговоров.ЗначенияПеречисления Цикл

		Если ТипЗнч(СтрокаПоиска) = Тип("Строка") И Не ПустаяСтрока(СтрокаПоиска) И СтрНайти(НРег(
			ЗначениеПеречисления.Синоним), НРег(СтрокаПоиска)) <> 1 Тогда
			Продолжить;
		КонецЕсли;
		Ссылка = Перечисления.ВидыАгентскихДоговоров[ЗначениеПеречисления.Имя];
		Если ТипЗнч(Отбор) = Тип("ПеречислениеСсылка.ВидыАгентскихДоговоров") И Отбор <> Ссылка Тогда
			Продолжить;
		ИначеЕсли (ТипЗнч(Отбор) = Тип("ФиксированныйМассив") Или ТипЗнч(Отбор) = Тип("Массив")) И Отбор.Найти(Ссылка)
			= Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если Исключения.Найти(Ссылка) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДоступныеЗначения.Добавить(Ссылка, ЗначениеПеречисления.Синоним);

	КонецЦикла;

	Возврат ДоступныеЗначения;

КонецФункции

#КонецОбласти

#КонецЕсли
